app/controllers/maize_records_controller.rb

  def index
    @maize_records = MaizeRecord.all(:include => :site)
---
SELECT * FROM "maize_records" ORDER BY id ASC

  def edit
    @maize_record = MaizeRecord.find(params[:id])
---
SELECT * FROM "maize_records" WHERE ("maize_records"."id" = 2)

  def update
    @maize_record = MaizeRecord.update_attributes(params[:maize_record])
---
UPDATE "maize_records" SET "updated_at" = '2010-01-15 19:18:32.973287', "description" = E'(2730ñ2350 cal B.P. at two-sigmas; Beta-103315 Zarillo et al 2008:5007) estimated using oxcal with 2490 +/- 40